# Mean Encoding - target Ordinal Encoding

In [10]:
import pandas as pd
import numpy as np

In [13]:
df=pd.read_csv('titanic.csv', usecols=['Cabin','Survived'])

In [15]:
df.isnull().sum()

Survived      0
Cabin       687
dtype: int64

In [16]:
df.head(5)

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [18]:
# fill na with missing
df['Cabin'].fillna('Missing', inplace=True)

In [21]:
df.head(5)

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [24]:
df['Cabin'] =  df['Cabin'].astype(str).str[0]

In [25]:
df

     Survived Cabin
0           0     M
1           1     C
2           1     M
3           1     C
4           0     M
..        ...   ...
886         0     M
887         1     B
888         0     M
889         1     C
890         0     M

[891 rows x 2 columns]

In [26]:
# Handle ordinal encoding for cabin first

df['Cabin'].unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [33]:
ordinal_labels =df.groupby('Cabin')['Survived'].mean().sort_values().index

In [34]:
ordinal_labels

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [37]:
dict= {k:i for i,k in enumerate(ordinal_labels)}

In [38]:
dict

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [39]:
df['Cabin_ordinal']= df['Cabin'].map(dict)

In [40]:
df

     Survived Cabin  Cabin_ordinal
0           0     M              1
1           1     C              4
2           1     M              1
3           1     C              4
4           0     M              1
..        ...   ...            ...
886         0     M              1
887         1     B              6
888         0     M              1
889         1     C              4
890         0     M              1

[891 rows x 3 columns]

In [46]:
# create another column with mean
mean_ordinal= df.groupby('Cabin')['Survived'].mean().to_dict()
mean_ordinal

{'A': 0.4666666666666667,
 'B': 0.7446808510638298,
 'C': 0.5932203389830508,
 'D': 0.7575757575757576,
 'E': 0.75,
 'F': 0.6153846153846154,
 'G': 0.5,
 'M': 0.29985443959243085,
 'T': 0.0}

In [44]:
df['Cabin_mean_ordinal']= df['Cabin'].map(mean_ordinal)

In [47]:
df

     Survived Cabin  Cabin_ordinal  Cabin_mean_ordinal
0           0     M              1            0.299854
1           1     C              4            0.593220
2           1     M              1            0.299854
3           1     C              4            0.593220
4           0     M              1            0.299854
..        ...   ...            ...                 ...
886         0     M              1            0.299854
887         1     B              6            0.744681
888         0     M              1            0.299854
889         1     C              4            0.593220
890         0     M              1            0.299854

[891 rows x 4 columns]

In [ ]:
# Thanks